---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.ImportIFCCategoryTable
source: html/f55f827b-c745-26d5-48be-5f41851fbbc8.htm
---
# Autodesk.Revit.ApplicationServices.Application.ImportIFCCategoryTable Property

Full path to the file that defines IFC entity to Revit category mappings for IFC import.

## Syntax (C#)
```csharp
public string ImportIFCCategoryTable { get; }
```